#pragma once
#include "Fwk/Framework.h"
#include "Fwk/Graphics.h"
#include "GameDef.h"

//-----------------------------------------------------------------------------
// Score_UI
//-----------------------------------------------------------------------------
// ゲーム内で得点判定やスコア表示を行うUIクラス
// Good / Normal 判定に応じた表示が可能
//-----------------------------------------------------------------------------
class Score_UI
{
public:
    //----------------------------------------------------------------------------- 
    // 初期化
    // テクスチャ読み込み、スプライト初期化
    //-----------------------------------------------------------------------------
    void Init();

    //-----------------------------------------------------------------------------
    // 終了処理
    // スプライト終了・テクスチャ解放
    //-----------------------------------------------------------------------------
    void Term();

    //-----------------------------------------------------------------------------
    // 更新処理
    // mDisplayTimer をカウントダウンして表示の制御などを行う
    //-----------------------------------------------------------------------------
    void Update();

    //-----------------------------------------------------------------------------
    // 描画
    // 判定バーやGood/Normal表示を描画
    //-----------------------------------------------------------------------------
    void Render();

    //-----------------------------------------------------------------------------
    // スコア設定
    // Good / Normal / None などを外部から設定
    // 設定すると mDisplayTimer をリセットして表示する
    //-----------------------------------------------------------------------------
    void SetScore(Score score);

private:
    bool mIsVisible = true;       // UIが表示中かどうか
    float mDisplayTimer = 0.f;    // スコア表示タイマー
    Score mCurrentScore = Score::None;  // 現在表示するスコア

    // UIの描画位置
    float mX = 230.f;
    float mY = -200.f;

    // スプライトサイズ
    float width = 1000;
    float height = 1000;

    // テクスチャ
    Texture mBarTex;      // 判定バー背景
    Texture mGoodTex;     // Good 判定用
    Texture mNormalTex;   // Normal 判定用

    // スプライト
    Sprite  mBarSprite;
    Sprite  mGoodSprite;
    Sprite  mNormalSprite;
};
